#include<stdio.h>

int main(){
    int a =1 ,b=1,i=2;//a,bคือ 2 ตัวแรกของลำดับ i คือตัวไล่ลำดับ
    int num=44;//num คือตัวที่้บอกว่าเอาเลขลำดับที่เท่าไหร่
    int result;//result คือผลลัพธ์
    while(i<num){
        if( i % 2 == 0){
            a=a+b;//ถ้าเป็นตัวที่ลำดับเป็นเลขคู่ จะเเปลี่ยน a เป็น a+b
            result=a;//เก็บresult เป็น a ค่าใหม่
        }else if(i%2==1){
            b=a+b;//ถ้าเป็นตัวที่ลำดับเป็นเลขคี่ จะเเปลี่ยน b เป็น a+b
            result=b;//เก็บresult เป็น b ค่าใหม่
        }
        i++;//เพิ่มค่า i
    }
    printf("%d",result);//พิมพ์ผลลัพธ์
}